bve/meshtastic-nrf52840-stm32wle5c/src/mesh/RadioInterface.cpp
    /*
        Philippines
                433 - 434.7 MHz <10 mW erp, NTC approved device required
                868 - 869.4 MHz <25 mW erp, NTC approved device required
                915 - 918 MHz <250 mW EIRP, no external antenna allowed
                https://github.com/meshtastic/firmware/issues/4948#issuecomment-2394926135
    */

    RDEF(PH_433, 433.0f, 434.7f, 100, 10, false, false, PROFILE_STD, PRESET(LONG_FAST), 0),
    RDEF(PH_868, 868.0f, 869.4f, 100, 14, false, false, PROFILE_STD, PRESET(LONG_FAST), 0),
    RDEF(PH_915, 915.0f, 918.0f, 100, 24, false, false, PROFILE_STD, PRESET(LONG_FAST), 0),

    /*
        Kazakhstan
                433.075 - 434.775 MHz <10 mW EIRP, Low Powered Devices (LPD)
                863 - 868 MHz <25 mW EIRP, 500kHz channels allowed, must not be used at airfields
                                https://github.com/meshtastic/firmware/issues/7204
    */
    RDEF(KZ_433, 433.075f, 434.775f, 100, 10, false, false, PROFILE_STD, PRESET(LONG_FAST), 0),
    RDEF(KZ_863, 863.0f, 868.0f, 100, 30, false, false, PROFILE_STD, PRESET(LONG_FAST), 0),

    /*
        Nepal
        865 MHz to 868 MHz frequency band for IoT (Internet of Things), M2M (Machine-to-Machine), and smart metering use,
       specifically in non-cellular mode. https://www.nta.gov.np/uploads/contents/Radio-Frequency-Policy-2080-English.pdf
    */
    RDEF(NP_865, 865.0f, 868.0f, 100, 30, false, false, PROFILE_STD, PRESET(LONG_FAST), 0),

    /*
        Brazil
        902 - 907.5 MHz , 1W power limit, no duty cycle restrictions
        https://github.com/meshtastic/firmware/issues/3741
    */
    RDEF(BR_902, 902.0f, 907.5f, 100, 30, false, false, PROFILE_STD, PRESET(LONG_FAST), 0),

    /*
        ITU Region 1 (Europe, Africa, Middle East, former USSR) amateur 2m allocation: 144.000 - 146.000 MHz.
        Power limit is the regulatory ceiling (1 W / 30 dBm) - individual hardware will cap below this
        via its own PA curve; the field here is just the legal upper bound.

        Default slot: 26 (144.510 MHz)
        https://www.iaru-r1.org/wp-content/uploads/2020/12/VHF-Bandplan.pdf
    */
    RDEF(ITU1_2M, 144.0f, 146.0f, 100, 30, false, false, PROFILE_HAM_20KHZ, PRESET(TINY_FAST), 26),

    /*
        ITU Region 2 (Americas) amateur 2m allocation: 144.000 - 148.000 MHz.
        Typical admin rules (e.g. US FCC Part 97) allow well above 30 dBm for licensed operators.

        Default slot: 51 (145.010 MHz)
        https://www.arrl.org/band-plan
    */
    RDEF(ITU2_2M, 144.0f, 148.0f, 100, 30, false, false, PROFILE_HAM_20KHZ, PRESET(TINY_FAST), 51),

    /*
        ITU Region 3 (Asia/Pacific) amateur 2m allocation: 144.000 - 148.000 MHz.
        Typical admin rules allow well above 30 dBm for licensed operators.

        Default slot: 33 (144.650 MHz)
        https://www.iaru.org/wp-content/uploads/2020/01/R3-004-IARU-Region-3-Bandplan-rev.2.pdf
        https://www.wia.org.au/members/bandplans/data/documents/WIA%20Australian%20Band%20Plan%202026.pdf
    */
    RDEF(ITU3_2M, 144.0f, 148.0f, 100, 30, false, false, PROFILE_HAM_20KHZ, PRESET(TINY_FAST), 33),

    /*
        ITU Region 2 (Americas) amateur 1.25m '125cm' allocation: 220.000 - 225.000 MHz.
        Typical admin rules (e.g. US FCC Part 97) allow well above 30 dBm for licensed operators.
        Note: Some countries do not allocate 220-222 MHz (e.g. USA, Canada). Check local law!

        Default slot: 37 (223.650 MHz)
        https://www.arrl.org/band-plan
    */
    RDEF(ITU2_125CM, 220.0f, 225.0f, 100, 30, false, false, PROFILE_HAM_100KHZ, PRESET(NARROW_SLOW), 37),

    /*
        ITU Region 1 (Europe, Africa, Middle East, former USSR) amateur 70cm allocation: 430.000 - 440.000 MHz.
        Power limit is the regulatory ceiling (1 W / 30 dBm) - individual hardware will cap below this
        via its own PA curve; the field here is just the legal upper bound.

        Default slot: 37 (433.650 MHz)
    */
    RDEF(ITU1_70CM, 430.0f, 440.0f, 100, 30, false, false, PROFILE_HAM_100KHZ, PRESET(NARROW_SLOW), 37),

    /*
        ITU Region 2 (Americas) amateur 70cm allocation: 420.000 - 450.000 MHz.
        Typical admin rules (e.g. US FCC Part 97) allow well above 30 dBm for licensed operators.
        Note: Some countries do not allocate 420-430 MHz or 440-450 MHz. Check local law!

        Default slot: 137 (433.650 MHz)
    */
    RDEF(ITU2_70CM, 420.0f, 450.0f, 100, 30, false, false, PROFILE_HAM_100KHZ, PRESET(NARROW_SLOW), 137),

    /*
        ITU Region 3 (Asia/Pacific) amateur 70cm allocation: 430.000 - 450.000 MHz.
        Typical admin rules allow well above 30 dBm for licensed operators.
        Note: Some countries do not allocate 440-450 MHz. Check local law!

        Default slot: 37 (433.650 MHz)
    */
    RDEF(ITU3_70CM, 430.0f, 450.0f, 100, 30, false, false, PROFILE_HAM_100KHZ, PRESET(NARROW_SLOW), 37),

    /*
       2.4 GHZ WLAN Band equivalent. Only for SX128x chips.
    */
    RDEF(LORA_24, 2400.0f, 2483.5f, 100, 10, false, true, PROFILE_STD, PRESET(LONG_FAST), 0),

    /*
        This needs to be last. Same as US.
    */
    RDEF(UNSET, 902.0f, 928.0f, 100, 30, false, false, PROFILE_UNDEF, PRESET(LONG_FAST), 0),

};

const RegionInfo *myRegion;
bool RadioInterface::uses_default_frequency_slot = true;
bool RadioInterface::uses_custom_channel_name = false;

static uint8_t bytes[MAX_LORA_PAYLOAD_LEN + 1];

// Global LoRa radio type
LoRaRadioType radioType = NO_RADIO;

extern RadioLibHal *RadioLibHAL;
#if defined(HW_SPI1_DEVICE) && defined(ARCH_ESP32)
#if defined(HAS_SDCARD) && defined(SDCARD_USE_SPI1)
extern SPIClass &SPI1; // alias for SPI_HSPI; both on SPI2_HOST
#else
extern SPIClass SPI1;
#endif
#endif

#ifndef LORA_SPI_FREQUENCY
#define LORA_SPI_FREQUENCY 4000000
#endif

std::unique_ptr<RadioInterface> __attribute__((weak))
createVariantRadioInterface(LockingArduinoHal *hal, const SPISettings &spiSettings, LoRaRadioType &detectedRadioType)
{
    (void)hal;
    (void)spiSettings;
    (void)detectedRadioType;
    return nullptr;
}

std::unique_ptr<RadioInterface> initLoRa()
{
    std::unique_ptr<RadioInterface> rIf = nullptr;

#if ARCH_PORTDUINO
    SPISettings loraSpiSettings(portduino_config.spiSpeed, MSBFIRST, SPI_MODE0);
#else
    SPISettings loraSpiSettings(LORA_SPI_FREQUENCY, MSBFIRST, SPI_MODE0);
#endif

#ifdef ARCH_PORTDUINO
    // as one can't use a function pointer to the class constructor:
    auto loraModuleInterface = [](LockingArduinoHal *hal, RADIOLIB_PIN_TYPE cs, RADIOLIB_PIN_TYPE irq, RADIOLIB_PIN_TYPE rst,
                                  RADIOLIB_PIN_TYPE busy) {
        switch (portduino_config.lora_module) {
        case use_rf95:
            return std::unique_ptr<RadioInterface>(new RF95Interface(hal, cs, irq, rst, busy));
        case use_sx1262:
            return std::unique_ptr<RadioInterface>(new SX1262Interface(hal, cs, irq, rst, busy));
        case use_sx1268:
            return std::unique_ptr<RadioInterface>(new SX1268Interface(hal, cs, irq, rst, busy));
        case use_sx1280:
            return std::unique_ptr<RadioInterface>(new SX1280Interface(hal, cs, irq, rst, busy));
        case use_lr1110:
            return std::unique_ptr<RadioInterface>(new LR1110Interface(hal, cs, irq, rst, busy));
        case use_lr1120:
            return std::unique_ptr<RadioInterface>(new LR1120Interface(hal, cs, irq, rst, busy));
        case use_lr1121:
            return std::unique_ptr<RadioInterface>(new LR1121Interface(hal, cs, irq, rst, busy));
        case use_llcc68:
            return std::unique_ptr<RadioInterface>(new LLCC68Interface(hal, cs, irq, rst, busy));
        case use_lr2021:
            return std::unique_ptr<RadioInterface>(new LR2021Interface(hal, cs, irq, rst, busy));
        case use_simradio:
            return std::unique_ptr<RadioInterface>(new SimRadio);
        default:
            assert(0); // shouldn't happen
            return std::unique_ptr<RadioInterface>(nullptr);
        }
    };

    LOG_DEBUG("Activate %s radio on SPI port %s", portduino_config.loraModules[portduino_config.lora_module].c_str(),
              portduino_config.lora_spi_dev.c_str());
    if (portduino_config.lora_spi_dev == "ch341") {
        RadioLibHAL = ch341Hal;
    } else {
        if (RadioLibHAL != nullptr) {
            delete RadioLibHAL;
            RadioLibHAL = nullptr;
        }
        RadioLibHAL = new LockingArduinoHal(SPI, loraSpiSettings);
    }
    rIf =
        loraModuleInterface((LockingArduinoHal *)RadioLibHAL, portduino_config.lora_cs_pin.pin, portduino_config.lora_irq_pin.pin,
                            portduino_config.lora_reset_pin.pin, portduino_config.lora_busy_pin.pin);

    if (!rIf->init()) {
        LOG_WARN("No %s radio", portduino_config.loraModules[portduino_config.lora_module].c_str());
        rIf = nullptr;
        exit(EXIT_FAILURE);
    } else {
        LOG_INFO("%s init success", portduino_config.loraModules[portduino_config.lora_module].c_str());
    }

#elif defined(HW_SPI1_DEVICE)
    LockingArduinoHal *loraHal = new LockingArduinoHal(SPI1, loraSpiSettings);
    RadioLibHAL = loraHal;
#elif defined(ARCH_ESP32) && defined(USE_MCP23017)
    // Radio control lines (RESET/DIO1/BUSY) are virtual pins on an MCP23017 I2C expander
    LockingArduinoHal *loraHal = new MCP23017LockingArduinoHal(SPI, loraSpiSettings, mcpIoExpander);
    RadioLibHAL = loraHal;
#else // HW_SPI1_DEVICE
    LockingArduinoHal *loraHal = new LockingArduinoHal(SPI, loraSpiSettings);
    RadioLibHAL = loraHal;
#endif

