bve/meshtastic-nrf52840-stm32wle5c/src/mesh/RadioInterface.cpp
#if defined(USE_LR2021) && RADIOLIB_EXCLUDE_LR2021 != 1
    if (!rIf) {
        rIf = std::unique_ptr<LR2021Interface>(
            new LR2021Interface(loraHal, LR2021_SPI_NSS_PIN, LR2021_IRQ_PIN, LR2021_NRESET_PIN, LR2021_BUSY_PIN));
        if (!rIf->init()) {
            LOG_WARN("No LR2021 radio");
            rIf = nullptr;
        } else {
            LOG_INFO("LR2021 init success");
            radioType = LR2021_RADIO;
        }
    }
#endif

#if defined(USE_SX1280) && RADIOLIB_EXCLUDE_SX128X != 1
    if (!rIf) {
        rIf = std::unique_ptr<SX1280Interface>(new SX1280Interface(loraHal, SX128X_CS, SX128X_DIO1, SX128X_RESET, SX128X_BUSY));
        if (!rIf->init()) {
            LOG_WARN("No SX1280 radio");
            rIf = nullptr;
        } else {
            LOG_INFO("SX1280 init success");
            radioType = SX1280_RADIO;
        }
    }
#endif

    // check if the radio chip matches the selected region
    if ((config.lora.region == meshtastic_Config_LoRaConfig_RegionCode_LORA_24) && rIf && (!rIf->wideLora())) {
        LOG_WARN("LoRa chip does not support 2.4GHz. Revert to unset");
        config.lora.region = meshtastic_Config_LoRaConfig_RegionCode_UNSET;
        nodeDB->saveToDisk(SEGMENT_CONFIG);

        if (rIf && !rIf->reconfigure()) {
            LOG_WARN("Reconfigure failed, rebooting");
            if (screen) {
                screen->showSimpleBanner("Rebooting...");
            }
            rebootAtMsec = millis() + 5000;
        }
    }
    return rIf;
}

void initRegion()
{
    const RegionInfo *r = regions;
#ifdef REGULATORY_LORA_REGIONCODE
    for (; r->code != meshtastic_Config_LoRaConfig_RegionCode_UNSET && r->code != REGULATORY_LORA_REGIONCODE; r++)
        ;
    LOG_INFO("Wanted region %d, regulatory override to %s", config.lora.region, r->name);
#else
    for (; r->code != meshtastic_Config_LoRaConfig_RegionCode_UNSET && r->code != config.lora.region; r++)
        ;
    LOG_INFO("Wanted region %d, using %s", config.lora.region, r->name);
#endif
    myRegion = r;
}

const RegionInfo *getRegion(meshtastic_Config_LoRaConfig_RegionCode code)
{
    const RegionInfo *r = regions;
    for (; r->code != meshtastic_Config_LoRaConfig_RegionCode_UNSET && r->code != code; r++)
        ;
    return r;
}

void getRegionPresetMap(meshtastic_LoRaRegionPresetMap &map)
{
    map = meshtastic_LoRaRegionPresetMap_init_zero;

    const size_t maxGroups = sizeof(map.groups) / sizeof(map.groups[0]);
    const size_t maxRegions = sizeof(map.region_groups) / sizeof(map.region_groups[0]);
    const size_t maxPresets = sizeof(map.groups[0].presets) / sizeof(map.groups[0].presets[0]);

    // Coalesce regions that share an identical preset list into one group. Two
    // regions belong to the same group when they share the same RegionProfile
    // (which owns the preset list + licensing) AND the same default preset.
    // Keyed by profile pointer, not the preset-array pointer: PROFILE_NARROW and
    // PROFILE_HAM_100KHZ share PRESETS_NARROW but differ in licensedOnly.
    const RegionProfile *groupProfile[sizeof(map.groups) / sizeof(map.groups[0])] = {};

    for (const RegionInfo *r = regions; r->code != meshtastic_Config_LoRaConfig_RegionCode_UNSET; r++) {
        // No room left to map any further region; once full we can't add more, so
        // log once and stop. An incomplete map means clients won't constrain the
        // omitted regions, so this must be discoverable rather than silent.
        if (map.region_groups_count >= maxRegions) {
            LOG_ERROR("Region preset map full at %u regions; remaining regions omitted", (unsigned)maxRegions);
            break;
        }

        // Find the group this region belongs to, or create it.
        int gi = -1;
        for (pb_size_t g = 0; g < map.groups_count; g++) {
            if (groupProfile[g] == r->profile && map.groups[g].default_preset == r->getDefaultPreset()) {
                gi = g;
                break;
            }
        }
        if (gi < 0) {
            if (map.groups_count >= maxGroups) {
                // Out of group slots (should not happen for the current table). The
                // region can't be advertised; skip it but make the gap visible.
                LOG_ERROR("Region preset map out of group slots (%u); region %d omitted", (unsigned)maxGroups, r->code);
                continue;
            }
            gi = map.groups_count++;
            groupProfile[gi] = r->profile;
            meshtastic_LoRaPresetGroup &grp = map.groups[gi];
            grp.default_preset = r->getDefaultPreset();
            grp.licensed_only = r->profile->licensedOnly;
            grp.presets_count = 0;
            // EU 86x siblings advertise the trio's superset - any of those presets is
            // reachable from here via an automatic region swap. Every other region
            // advertises exactly its own enforced profile list.
            const meshtastic_Config_LoRaConfig_ModemPreset *advertised =
                isSwappableEuRegion(r->code) ? PRESETS_EU_SUPERSET : r->profile->presets;
            for (size_t i = 0; advertised[i] != MODEM_PRESET_END && grp.presets_count < maxPresets; i++)
                grp.presets[grp.presets_count++] = advertised[i];
        }

        // Map this region to its group (capacity checked at the top of the loop).
        meshtastic_LoRaRegionPresets &rg = map.region_groups[map.region_groups_count++];
        rg.region = r->code;
        rg.group_index = (uint8_t)gi;
    }
}

/**
 * Get duty cycle for current region. EU_866: 10% for routers, 2.5% for mobile.
 */
float getEffectiveDutyCycle()
{
    if (myRegion->code == meshtastic_Config_LoRaConfig_RegionCode_EU_866) {
        if (config.device.role == meshtastic_Config_DeviceConfig_Role_ROUTER ||
            config.device.role == meshtastic_Config_DeviceConfig_Role_ROUTER_LATE) {
            return 10.0f;
        } else {
            return 2.5f;
        }
    }
    // For all other regions, return the standard duty cycle
    return myRegion->dutyCycle;
}

