bve/meshtastic-nrf52840-stm32wle5c/src/mesh/RadioInterface.cpp
    configChangedObserver.observe(&service->configChanged);
    preflightSleepObserver.observe(&preflightSleep);
    notifyDeepSleepObserver.observe(&notifyDeepSleep);

    // we now expect interfaces to operate in promiscuous mode
    // radioIf.setThisAddress(nodeDB->getNodeNum()); // Note: we must do this here, because the nodenum isn't inited at
    // constructor time.

    applyModemConfig();

    return true;
}

int RadioInterface::notifyDeepSleepCb(void *unused)
{
    sleep();
    return 0;
}

/** hash a string into an integer
 *
 * djb2 by Dan Bernstein.
 * http://www.cse.yorku.ca/~oz/hash.html
 */
uint32_t hash(const char *str)
{
    uint32_t hash = 5381;
    int c;

    while ((c = *str++) != 0)
        hash = ((hash << 5) + hash) + (unsigned char)c; /* hash * 33 + c */

    return hash;
}

/**
 * Save our frequency for later reuse.
 */
void RadioInterface::saveFreq(float freq)
{
    savedFreq = freq;
}

/**
 * Save our frequency slot (aka channel) for later reuse.
 */
void RadioInterface::saveChannelNum(uint32_t channel_num)
{
    savedChannelNum = channel_num;
}

/**
 * Save our frequency for later reuse.
 */
float RadioInterface::getFreq()
{
    return savedFreq;
}

/**
 * Save our channel for later reuse.
 */
uint32_t RadioInterface::getChannelNum()
{
    return savedChannelNum;
}

/**
 * Send a client notification (error level unless specified). Safe to call when service is null (e.g. in tests).
 */
static void sendErrorNotification(const char *msg, meshtastic_LogRecord_Level level = meshtastic_LogRecord_Level_ERROR)
{
    if (!service)
        return;
    meshtastic_ClientNotification *cn = clientNotificationPool.allocZeroed();
    if (!cn)
        return;
    cn->level = level;
    snprintf(cn->message, sizeof(cn->message), "%s", msg);
    service->sendClientNotification(cn);
}

/**
 * If currentRegion is one of the swappable EU regions and preset belongs to a sibling in
 * that trio, return the sibling region that owns the preset. Returns nullptr otherwise.
 */
const RegionInfo *RadioInterface::regionSwapForPreset(meshtastic_Config_LoRaConfig_RegionCode currentRegion,
                                                      meshtastic_Config_LoRaConfig_ModemPreset preset)
{
    if (!isSwappableEuRegion(currentRegion))
        return nullptr;

    for (auto code : SWAPPABLE_EU_REGIONS) {
        if (code == currentRegion)
            continue;
        const RegionInfo *sibling = getRegion(code);
        if (sibling->supportsPreset(preset))
            return sibling;
    }
    return nullptr;
}

/**
 * Checks if a region is valid for the current settings, with no side effects.
 * Safe to call speculatively (e.g. from UI pickers). When errBuf is given, it
 * receives the human-readable failure reason.
 * Returns false if not compatible.
 */
bool RadioInterface::checkConfigRegion(const meshtastic_Config_LoRaConfig &loraConfig, char *errBuf, size_t errLen,
                                       bool prospectiveLicensedOwner)
{
    const RegionInfo *newRegion = getRegion(loraConfig.region);

    // Reject unrecognized region codes (getRegion returns UNSET sentinel for unknown codes)
    if (newRegion->code != loraConfig.region) {
        if (errBuf)
            snprintf(errBuf, errLen, "Region code %d is not recognized", loraConfig.region);
        return false;
    }

    // If you are not licensed, you can't use ham regions.
    if (newRegion->profile->licensedOnly && !devicestate.owner.is_licensed && !prospectiveLicensedOwner) {
        if (errBuf)
            snprintf(errBuf, errLen, "Region %s requires licensed mode", newRegion->name);
        return false;
    }

    // Hardware compatibility: wide-LoRa (2.4 GHz) regions need a wide-capable radio, and
    // sub-GHz regions need a radio that can tune below 2.4 GHz (SX128x cannot). UNSET is
    // always allowed since it is the "no region" state.
    if (newRegion->code != meshtastic_Config_LoRaConfig_RegionCode_UNSET && RadioLibInterface::instance) {
        const char *unsupported = nullptr;
        if (newRegion->wideLora && !RadioLibInterface::instance->wideLora()) {
            unsupported = "2.4 GHz";
        } else if (!newRegion->wideLora && !RadioLibInterface::instance->supportsSubGhz()) {
            unsupported = "sub-GHz";
        }
        if (unsupported) {
            if (errBuf)
                snprintf(errBuf, errLen, "Region %s needs %s, which this radio does not support", newRegion->name, unsupported);
            return false;
        }
    }

    return true;
}

/**
 * Checks if a region is valid for the current settings. On failure, logs at ERROR,
 * records a critical error, and sends a client notification.
 * Returns false if not compatible.
 */
bool RadioInterface::validateConfigRegion(const meshtastic_Config_LoRaConfig &loraConfig)
{
    char err_string[160];
    if (checkConfigRegion(loraConfig, err_string, sizeof(err_string)))
        return true;

    LOG_ERROR("%s", err_string);
    RECORD_CRITICALERROR(meshtastic_CriticalErrorCode_INVALID_RADIO_SETTING);
    sendErrorNotification(err_string);
    return false;
}

/**
 * Internal helper: check or clamp a LoRa config against its region.
 * When clamp==false, returns false on first error (pure validation).
 * When clamp==true, fixes invalid settings in-place and returns true.
 */
bool RadioInterface::checkOrClampConfigLora(meshtastic_Config_LoRaConfig &loraConfig, bool clamp)
{
    char err_string[160];
    float check_bw;

    const RegionInfo *newRegion = getRegion(loraConfig.region);

    const char *presetName = DisplayFormatters::getModemPresetDisplayName(loraConfig.modem_preset, false, loraConfig.use_preset);

    // Check preset validity (only when use_preset is true)
    if (loraConfig.use_preset) {
        check_bw = modemPresetToBwKHz(loraConfig.modem_preset, newRegion->wideLora);

        bool preset_valid = newRegion->supportsPreset(loraConfig.modem_preset);
        if (!preset_valid) {
            // A preset locked to a sibling of the swappable EU regions swaps the region instead
            // of clamping the preset, as long as the previous region was itself one of the trio.
            const RegionInfo *swapRegion = regionSwapForPreset(loraConfig.region, loraConfig.modem_preset);
            if (swapRegion) {
                if (!clamp) {
                    // Validation must still fail so callers route into the clamp, but quietly:
                    // the clamp will accept this config by swapping regions, so don't record a
                    // critical error or alarm the user over a change that is about to succeed.
                    LOG_INFO("Preset %s implies region swap %s to %s, deferring to clamp", presetName, newRegion->name,
                             swapRegion->name);
                    return false;
                }
                snprintf(err_string, sizeof(err_string), "Preset %s swaps region %s to %s", presetName, newRegion->name,
                         swapRegion->name);
                LOG_INFO("%s", err_string);
                sendErrorNotification(err_string, meshtastic_LogRecord_Level_INFO);

