bve/meshtastic-nrf52840-stm32wle5c/src/mesh/RadioInterface.cpp
                loraConfig.region = swapRegion->code;
                newRegion = swapRegion;
                check_bw = modemPresetToBwKHz(loraConfig.modem_preset, newRegion->wideLora);
                preset_valid = true;
            }
        }
        if (!preset_valid) {
            const char *defaultName = DisplayFormatters::getModemPresetDisplayName(newRegion->getDefaultPreset(), false, true);
            if (clamp) {
                snprintf(err_string, sizeof(err_string), "Preset %s invalid for %s, using %s", presetName, newRegion->name,
                         defaultName);
            } else {
                snprintf(err_string, sizeof(err_string), "Preset %s invalid for %s", presetName, newRegion->name);
            }
            LOG_ERROR("%s", err_string);
            RECORD_CRITICALERROR(meshtastic_CriticalErrorCode_INVALID_RADIO_SETTING);
            sendErrorNotification(err_string);

            if (clamp) {
                loraConfig.modem_preset = newRegion->getDefaultPreset();
                check_bw = modemPresetToBwKHz(loraConfig.modem_preset, newRegion->wideLora);
            } else {
                return false;
            }
        }
    } else {
        // Clamp at the source so numFreqSlots below can never be 0 (bandwidth 0 is reachable from a crafted set_config)
        check_bw = clampBandwidthKHz(bwCodeToKHz(loraConfig.bandwidth));
    }

    // Calculate width of slots (aka channels) based on bandwidth and any spacing or padding required by the region:
    // spacing = gap between slots (0 for continuous spectrum) and at the beginning of the band
    // padding = gap at the beginning and end of the slots (0 for no padding)
    float freqSlotWidth = newRegion->profile->spacing + (newRegion->profile->padding * 2) + (check_bw / 1000); // in MHz
    uint32_t numFreqSlots = round((newRegion->freqEnd - newRegion->freqStart + newRegion->profile->spacing) / freqSlotWidth);

    // Check if the region supports the requested bandwidth
    if ((newRegion->freqEnd - newRegion->freqStart) < freqSlotWidth) {
        const float regionSpanKHz = (newRegion->freqEnd - newRegion->freqStart) * 1000.0f;
        snprintf(err_string, sizeof(err_string), "%s span %.0fkHz < requested %.0fkHz", newRegion->name, regionSpanKHz, check_bw);
        LOG_ERROR("%s", err_string);
        RECORD_CRITICALERROR(meshtastic_CriticalErrorCode_INVALID_RADIO_SETTING);
        sendErrorNotification(err_string);

        if (clamp) {
            loraConfig.bandwidth = bwKHzToCode(modemPresetToBwKHz(newRegion->getDefaultPreset(), newRegion->wideLora));
            check_bw = bwCodeToKHz(loraConfig.bandwidth);

            // Recompute slot width and number of slots based on the new bandwidth
            freqSlotWidth = newRegion->profile->spacing + (newRegion->profile->padding * 2) + (check_bw / 1000); // in MHz
            numFreqSlots = round((newRegion->freqEnd - newRegion->freqStart + newRegion->profile->spacing) / freqSlotWidth);
        } else {
            return false;
        }
    }

    const char *channelName = channels.getName(channels.getPrimaryIndex());
    const char *presetNameDisplay =
        DisplayFormatters::getModemPresetDisplayName(loraConfig.modem_preset, false, loraConfig.use_preset);
    // numFreqSlots can still be 0 for an UNSET/degenerate region, and % 0 is a SIGFPE
    uint32_t channelNameHashSlot = numFreqSlots ? (hash(channelName) % numFreqSlots) : 0;
    uint32_t presetNameHashSlot = numFreqSlots ? (hash(presetNameDisplay) % numFreqSlots) : 0;

    if (loraConfig.override_frequency == 0) {

        // Check if we use the default frequency slot
        // overrideSlot: 0 = channel hash, -1 = preset hash, >0 = explicit slot
        uses_default_frequency_slot =
            (loraConfig.channel_num == 0) || // user choice unset, no frequency override, so use default
            (newRegion->overrideSlot > 0 &&
             loraConfig.channel_num == newRegion->overrideSlot) || // user setting matches explicit override slot
            ((newRegion->overrideSlot == OVERRIDE_SLOT_DEFAULT_CHANNEL_HASH) &&
             ((uint32_t)(loraConfig.channel_num - 1) == channelNameHashSlot)) || // user setting matches channel name hash
            ((newRegion->overrideSlot == OVERRIDE_SLOT_PRESET_HASH) &&
             ((uint32_t)(loraConfig.channel_num - 1) == presetNameHashSlot)); // user setting matches preset name hash

        // check if user setting different to preset name
        uses_custom_channel_name = (strcmp(channelName, presetNameDisplay) != 0);

        if (loraConfig.channel_num > numFreqSlots) {
            snprintf(err_string, sizeof(err_string), "Channel number %u invalid for %s, max is %u", loraConfig.channel_num,
                     newRegion->name, numFreqSlots);
            LOG_ERROR("%s", err_string);
            RECORD_CRITICALERROR(meshtastic_CriticalErrorCode_INVALID_RADIO_SETTING);
            sendErrorNotification(err_string);

            if (clamp) {
                if (uses_custom_channel_name) { // clamp to channel name hash
                    loraConfig.channel_num =
                        channelNameHashSlot + 1;          // channel_num is 1-based, but hash slot is 0-based, so add 1
                } else if (newRegion->overrideSlot > 0) { // clamp to explicit override slot
                    loraConfig.channel_num = newRegion->overrideSlot; // use the explicit override slot defined for this region
                    uses_default_frequency_slot = true;
                } else if (newRegion->overrideSlot == OVERRIDE_SLOT_PRESET_HASH && loraConfig.use_preset) {
                    // clamp to preset name hash
                    loraConfig.channel_num = presetNameHashSlot + 1; // channel_num is 1-based, but hash slot is 0-based, so add 1
                    uses_default_frequency_slot = true;
                } else if (loraConfig.use_preset) {                  // clamp to preset slot
                    loraConfig.channel_num = presetNameHashSlot + 1; // channel_num is 1-based, but hash slot is 0-based, so add 1
                    uses_default_frequency_slot = true;
                } else { // if not using preset, and no custom channel name, just clamp to default anyway
                    uses_default_frequency_slot = true;
                };
            } else {
                return false;
            }
        } // end of channel number check
    } else {
        // if we have a frequency override, we ignore the channel number and just use the override frequency
        snprintf(err_string, sizeof(err_string), "Frequency override in place, using %.3f", loraConfig.override_frequency);
    }
    return true;
}

bool RadioInterface::validateConfigLora(const meshtastic_Config_LoRaConfig &loraConfig)
{
    auto copy = loraConfig;
    return checkOrClampConfigLora(copy, false);
}

